package com.kunyandata.backtesting.parser

import scala.collection.immutable.HashMap

/**
  * Created by YangShuai
  * Created on 2016/8/24.
  */
object Query {

  def parser (text: String, code: Map[String, Int]) = {

    val queries = text.split("\\+")

    val resultTemp = queries.map(query => {

      rules(query, code)
    })

    resultTemp.groupBy(_._1).map(x => (x._1, x._2.map(_._2).mkString(",")))
  }

  private def rules(text: String, code: Map[String, Int]): (Int, String) = {

    //事件
    if(text.startsWith("事件：")){

      (1901, text)
    }else{

      //提取语句编码
      val keyNum = code.getOrElse(text.replaceAll("\\d+", "X"), -1)

      if (keyNum == -1) {

        (keyNum, text)
      } else {

        //提取语句中数字参数
        val regex = """\d+""".r
        val value = regex.findAllIn(text).toArray

        if (value.length == 0) {

          (keyNum, "1")
        } else if (value.length == 1) {

          (keyNum, value.mkString(""))
        } else if (value.length == 2 && (value(0).toInt < value(1).toInt)) {

          (keyNum, value.mkString(","))
        } else if (value.length == 3) {

          if ((keyNum == 2407 || keyNum == 2408) && (value(0).toInt < value(1).toInt)) {
            (keyNum, value.mkString(","))
          } else if ((keyNum == 2409 || keyNum == 2410) && (value(1).toInt < value(2).toInt)) {

            (keyNum, value.mkString(","))
          } else {

            (-1, text)
          }
        } else {

          (-1, text)
        }
      }


    }
  }

  def initQueryMap = {

    HashMap(("总股本大于X亿", 101),
      ("总股本小于X亿", 102),
      ("总股本等于X亿", 103),
      ("总股本大于X亿小于X亿", 104),
      ("总股本小于等于X亿", 105),
      ("总股本大于等于X亿", 106),
      ("流通股本大于X亿", 201),
      ("流通股本小于X亿", 202),
      ("流通股本等于X亿", 203),
      ("流通股本大于X亿小于X亿", 204),
      ("流通股本大于等于X亿", 205),
      ("流通股本小于等于X亿", 206),
      ("总市值大于X亿", 301),
      ("总市值小于X亿", 302),
      ("总市值等于X亿", 303),
      ("总市值大于X亿小于X亿", 304),
      ("总市值大于等于X亿", 305),
      ("总市值小于等于X亿", 306),
      ("流通市值大于X亿", 401),
      ("流通市值小于X亿", 402),
      ("流通市值等于X亿", 403),
      ("流通市值大于X亿小于X亿", 404),
      ("流通市值大于等于X亿", 405),
      ("流通市值小于等于X亿", 406),
      ("流通比例大于X%", 501),
      ("流通比例小于X%", 502),
      ("流通比例等于X%", 503),
      ("流通比例大于X%小于X%", 504),
      ("流通比例大于等于X%", 505),
      ("流通比例小于等于X%", 506),
      ("十大股东持股比例大于X%", 601),
      ("十大股东持股比例小于X%", 602),
      ("十大股东持股比例等于X%", 603),
      ("十大股东持股比例大于X%小于X%", 604),
      ("十大股东持股比例大于等于X%", 605),
      ("十大股东持股比例小于等于X%", 606),
      ("股东户数大于X万", 701),
      ("股东户数小于X万", 702),
      ("股东户数等于X万", 703),
      ("股东户数大于X万小于X万", 704),
      ("股东户数大于等于X万", 705),
      ("股东户数小于等于X万", 706),
      ("户均持股数大于X万", 801),
      ("户均持股数小于X万", 802),
      ("户均持股数等于X万", 803),
      ("户均持股数大于X万小于X万", 804),
      ("户均持股数大于等于X万", 805),
      ("户均持股数小于等于X万", 806),
      ("大股东增股", 901),
      ("大股东减股", 902),
      ("高管增股", 903),
      ("高管减股", 904),
      ("基金持股", 1001),
      ("券商持股", 1002),
      ("社保持股", 1003),
      ("信托持股", 1004),
      ("保险持股", 1005),
      ("QFII持股", 1006),
      ("国家队持股", 1007),
      ("涨跌幅大于X%", 1101),
      ("涨跌幅小于X%", 1102),
      ("涨跌幅等于X%", 1103),
      ("涨跌幅大于X%小于X%", 1104),
      ("涨跌幅大于等于X%", 1105),
      ("涨跌幅小于等于X%", 1106),
      ("涨幅大于X%", 1107),
      ("涨幅小于X%", 1108),
      ("涨幅等于X%", 1109),
      ("涨幅大于X%小于X%", 1110),
      ("涨幅大于等于X%", 1111),
      ("涨幅小于等于X%", 1112),
      ("跌幅大于X%", 1113),
      ("跌幅小于X%", 1114),
      ("跌幅等于X%", 1115),
      ("跌幅大于等于X%", 1116),
      ("跌幅小于等于X%", 1117),
      ("跌幅大于X%小于X%", 1118),

      //振幅
      ("振幅大于X%", 1201),
      ("振幅小于X%", 1202),
      ("振幅等于X%", 1203),
      ("振幅大于X%小于X%", 1204),
      ("振幅大于等于X%", 1205),
      ("振幅小于等于X%", 1206),

      //换手率
      ("换手率大于X%", 1301),
      ("换手率小于X%", 1302),
      ("换手率等于X%", 1303),
      ("换手率大于X%小于X%", 1304),
      ("换手率大于等于X%", 1305),
      ("换手率小于等于X%", 1306),

      //成交量
      ("成交量大于X万", 1401),
      ("成交量小于X万", 1402),
      ("成交量等于X万", 1403),
      ("成交量大于X万小于X万", 1404),
      ("成交量大于等于X万", 1405),
      ("成交量小于等于X万", 1406),

      //成交额
      ("成交额大于X万", 1501),
      ("成交额小于X万", 1502),
      ("成交额等于X万", 1503),
      ("成交额大于X万小于X万", 1504),
      ("成交额大于等于X万", 1505),
      ("成交额小于等于X万", 1506),

      //股价
      ("股价大于X元", 1601),
      ("股价小于X元", 1602),
      ("股价等于X元", 1603),
      ("股价大于X元小于X元", 1604),
      ("股价大于等于X元", 1605),
      ("股价小于等于X元", 1606),

      //收益率
      ("收益率大于X%", 1701),
      ("收益率小于X%", 1702),
      ("收益率等于X%", 1703),
      ("收益率大于X小于X%", 1704),
      ("收益率大于等于X%", 1705),
      ("收益率小于等于X%", 1706),

      //公告性事件
      ("盈利预增X%", 1801),
      ("诉讼仲裁X次", 1802),
      ("违规处罚X次", 1803),
      ("盈利预增X%以上", 1804),
      ("诉讼仲裁X次以上", 1805),
      ("违规处罚X次以上", 1806),

      //新闻访问热度
      ("新闻访问热度每天大于X次", 2001),
      ("新闻访问热度每天小于X次", 2002),
      ("新闻访问热度每天等于X次", 2003),
      ("新闻访问热度每周大于X次", 2004),
      ("新闻访问热度每周小于X次", 2005),
      ("新闻访问热度每周等于X次", 2006),
      ("新闻访问热度每月大于X次", 2007),
      ("新闻访问热度每月小于X次", 2008),
      ("新闻访问热度每月等于X次", 2009),
      ("新闻访问热度每年大于X次", 2010),
      ("新闻访问热度每年小于X次", 2011),
      ("新闻访问热度每年等于X次", 2012),
      ("新闻访问热度每天大于等于X次", 2013),
      ("新闻访问热度每天小于等于X次", 2014),
      ("新闻访问热度每周大于等于X次", 2015),
      ("新闻访问热度每周小于等于X次", 2016),
      ("新闻访问热度每月大于等于X次", 2017),
      ("新闻访问热度每月小于等于X次", 2018),
      ("新闻访问热度每年大于等于X次", 2019),
      ("新闻访问热度每年小于等于X次", 2020),

      //新闻转载热度
      ("新闻转载热度每天大于X次", 2101),
      ("新闻转载热度每天小于X次", 2102),
      ("新闻转载热度每天等于X次", 2103),
      ("新闻转载热度每周大于X次", 2104),
      ("新闻转载热度每周小于X次", 2105),
      ("新闻转载热度每周等于X次", 2106),
      ("新闻转载热度每月大于X次", 2107),
      ("新闻转载热度每月小于X次", 2108),
      ("新闻转载热度每月等于X次", 2109),
      ("新闻转载热度每年大于X次", 2110),
      ("新闻转载热度每年小于X次", 2111),
      ("新闻转载热度每年等于X次", 2112),
      ("新闻转载热度每天大于等于X次", 2113),
      ("新闻转载热度每天小于等于X次", 2114),
      ("新闻转载热度每周大于等于X次", 2115),
      ("新闻转载热度每周小于等于X次", 2116),
      ("新闻转载热度每月大于等于X次", 2117),
      ("新闻转载热度每月小于等于X次", 2118),
      ("新闻转载热度每年大于等于X次", 2119),
      ("新闻转载热度每年小于等于X次", 2120),

      //新闻趋势
      ("新闻趋势连续X天上涨", 2201),
      ("新闻趋势连续X天下降", 2202),
      ("新闻趋势连续X天以上上涨", 2203),
      ("新闻趋势连续X天以上下降", 2204),

      //新闻情感
      ("新闻情感连续X天都是非负面情绪", 2301),
      ("新闻情感连续X天都是负面情绪", 2302),
      ("新闻情感连续X天以上都是非负面情绪", 2303),
      ("新闻情感连续X天以上都是负面情绪", 2304),

      //大V观点
      ("连续X天被X个大V看好", 2401),
      ("连续X天被X个大V看空", 2402),
      ("连续X天以上被X个大V看好", 2403),
      ("连续X天以上被X个大V看空", 2404),
      ("连续X天被X个大V以上看好", 2405),
      ("连续X天被X个大V以上看空", 2406),
      ("连续X~X天被X个大V看好", 2407),
      ("连续X~X天被X个大V看空", 2408),
      ("连续X天被X~X个大V看好", 2409),
      ("连续X天被X~X个大V看空", 2410),

      //行为数据
      ("查看热度连续X天上涨超过X", 2501),
      ("查看热度连续X天出现在topX", 2502),
      ("查看热度连续X天以上上涨超过X", 2503),
      ("查看热度连续X天以上出现在topX", 2504),
      ("查看热度连续X天超过X", 2505),
      ("查看热度连续X天以上超过X", 2506),

      //资金流入
      ("资金流入大于X万", 2601),
      ("资金流入小于X万", 2602),
      ("资金流入等于X万", 2603),
      ("资金流入大于X万小于X万", 2604),
      ("资金流入大于等于X万", 2605),
      ("资金流入小于等于X万", 2606))

    // 如果key为-1的话，说明查询条件不在以上列表或者以上列表中的查询条件不符合逻辑，例如大于2小于1。
  }
}